;; -*- no-byte-compile: t; -*-
(package! ctrlf)
(package! dired-narrow)
(package! deadgrep)
(package! easy-kill)
(package! org-clock-convenience)
(package! company-posframe)
(package! org-roam
  :recipe (:host github :repo "org-roam/org-roam"))
;; (package! org-roam-bibtex
;;   :recipe (:host github :repo "org-roam/org-roam-bibtex"))
(package! mathpix.el
  :recipe (:host github :repo "jethrokuan/mathpix.el"))
(package! modus-themes)
(package! outshine)
(package! ox-hugo
  :recipe (:host github :repo "jethrokuan/ox-hugo"))
(package! ox-texinfo+
  :recipe (:host github :repo "tarsius/ox-texinfo-plus"))
(package! nov
  :recipe (:type git :repo "https://depp.brause.cc/nov.el.git"))
(package! git-link)
(package! yaml-mode)
(package! emmet-mode)
(package! citeproc-org)
(package! dash)
(package! simple-httpd)
(package! org-present)
